system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;   

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             5;

deltaT              0.025;

writeControl        timeStep;

writeInterval       1;

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    off;

timeFormat          general;

timePrecision       12;

runTimeModifiable true;

functions
{

}
